Masmiseim36/nxpSDK/boards/mapsks22/project_template/pin_mux.c
/*
 * The Clear BSD License
 * Copyright 2017-2018 NXP
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKS22FN256xxx12
package_id: MKS22FN256VLL12
mcu_data: ksdk2_0
processor_version: 0.0.11
board: MAPS-KS22
pin_labels:
- {pin_num: '34', pin_signal: PTA0/UART0_CTS_b/TPM0_CH5/EWM_IN/JTAG_TCLK/SWD_CLK, label: 'CN9[34]/CN1[27]/CN6[9]/SWD_CLK', identifier: UART0_CTS}
- {pin_num: '35', pin_signal: PTA1/UART0_RX/CMP0_OUT/LPI2C1_HREQ/TPM1_CH1/JTAG_TDI, label: 'CN9[35]/CN8[3]/JP5[1]/ISO7816_CLK/TPM1_CH1', identifier: ISO7816_CLK}
- {pin_num: '36', pin_signal: PTA2/UART0_TX/TPM1_CH0/JTAG_TDO/TRACE_SWO, label: 'CN9[36]/CN8[7]/ISO7816_IO/UART0_TX', identifier: UART0_TX}
- {pin_num: '37', pin_signal: PTA3/UART0_RTS_b/TPM0_CH0/EWM_OUT_b/JTAG_TMS/SWD_DIO, label: 'CN9[37]/CN1[28]/CN6[7]/SWD_IO', identifier: UART0_RTS}
- {pin_num: '38', pin_signal: PTA4/LLWU_P3/TPM0_CH1/I2S0_MCLK/NMI_b, label: 'CN9[38]/CN2[6]/KEY_SEL', identifier: KEY_SEL}
- {pin_num: '39', pin_signal: PTA5/USB_CLKIN/TPM0_CH2/I2S0_TX_BCLK/JTAG_TRST_b, label: 'CN9[39]/CN1[21]/JP6[2]/I2S0_TX_BCLK', identifier: I2S0_TX_BCLK}
- {pin_num: '42', pin_signal: PTA12/CAN0_TX/TPM1_CH0/I2S0_TXD0, label: 'CN9[42]/CN1[23]/JP7[2]/I2S0_TXD0', identifier: I2S0_TXD0}
- {pin_num: '43', pin_signal: PTA13/LLWU_P4/CAN0_RX/TPM1_CH1/I2S0_TX_FS, label: 'CN9[43]/CN1[24]/JP8[2]/I2S0_TX_FS', identifier: I2S0_TX_FS}
- {pin_num: '44', pin_signal: PTA14/SPI0_PCS0/UART0_TX/I2S0_RX_BCLK, label: 'CN9[44]'}
- {pin_num: '45', pin_signal: PTA15/SPI0_SCK/UART0_RX/I2S0_RXD0, label: 'CN9[45]/CN1[26]/I2S0_RXD0', identifier: I2S0_RXD0}
- {pin_num: '46', pin_signal: PTA16/SPI0_SOUT/UART0_CTS_b/I2S0_RX_FS, label: 'CN9[46]/CN1[19]/I2S0_RX_FS', identifier: I2S0_RX_FS}
- {pin_num: '47', pin_signal: PTA17/SPI0_SIN/UART0_RTS_b/I2S0_MCLK, label: 'CN9[47]/CN1[22]/JP5[2]/I2S0_MCLK', identifier: I2S0_MCLK}
- {pin_num: '50', pin_signal: EXTAL0/PTA18/TPM_CLKIN0, label: 'CN9[50]/EXTAL', identifier: EXTAL}
- {pin_num: '53', pin_signal: ADC0_SE8/PTB0/LLWU_P5/LPI2C0_SCL/TPM1_CH0/FXIO0_D4/UART0_RX, label: 'CN9[53]/CN1[16]/CN4[4]/LPI2C0_SCL', identifier: LPI2C0_SCL}
- {pin_num: '54', pin_signal: ADC0_SE9/PTB1/LPI2C0_SDA/TPM1_CH1/EWM_IN/FXIO0_D5/UART0_TX, label: 'CN9[54]/CN1[15]/CN4[3]/LPI2C0_SDA', identifier: LPI2C0_SDA}
- {pin_num: '55', pin_signal: ADC0_SE12/PTB2/LPI2C0_SCL/UART0_RTS_b/FXIO0_D6/CAN1_RX, label: 'CN9[55]'}
- {pin_num: '56', pin_signal: ADC0_SE13/PTB3/LPI2C0_SDA/UART0_CTS_b/FXIO0_D7/CAN1_TX, label: 'CN9[56]/CN2[4]/CN2[22]/LED0/KEY_DOWN', identifier: LED_RED1;KEY_DOWN}
- {pin_num: '57', pin_signal: PTB9/SPI1_PCS1/LPUART0_CTS_b, label: 'CN9[57]/CN2[2]/CN2[21]/LED1/KEY_UP', identifier: LED_RED2;KEY_UP}
- {pin_num: '58', pin_signal: PTB10/SPI1_PCS0/LPUART0_RX/I2S1_TX_BCLK, label: 'CN9[58]/CN2[1]/CN2[20]/LED2/KEY_RIGHT', identifier: LED_RED3;KEY_RIGHT}
- {pin_num: '59', pin_signal: PTB11/SPI1_SCK/LPUART0_TX/I2S1_TX_FS, label: 'CN9[59]/CN2[3]/CN2[19]/LED3/KEY_LEFT', identifier: LED_GREEN;KEY_LEFT}
- {pin_num: '62', pin_signal: PTB16/SPI1_SOUT/UART0_RX/TPM_CLKIN0/EWM_IN/I2S1_TXD0, label: 'CN9[62]'}
- {pin_num: '63', pin_signal: PTB17/SPI1_SIN/UART0_TX/TPM_CLKIN1/EWM_OUT_b/FXIO0_D0, label: 'CN9[63]'}
- {pin_num: '64', pin_signal: PTB18/CAN0_TX/TPM2_CH0/I2S0_TX_BCLK/FXIO0_D1, label: 'CN9[64]/CAN0_TX', identifier: CAN0_TX}
- {pin_num: '65', pin_signal: PTB19/CAN0_RX/TPM2_CH1/I2S0_TX_FS/FXIO0_D2, label: 'CN9[65]/TPM2_CH1/CAN0_RX', identifier: CAN0_RX}
- {pin_num: '66', pin_signal: PTB20/CMP0_OUT/FXIO0_D4, label: 'CN9[66]/JP6[1]/FXIO0_D4', identifier: CMP0_OUT}
- {pin_num: '67', pin_signal: PTB21/FXIO0_D5, label: 'CN9[67]/JP7[1]/FXIO0_D5'}
- {pin_num: '68', pin_signal: PTB22/FXIO0_D6, label: 'CN9[68]/JP8[1]/FXIO0_D6'}
- {pin_num: '69', pin_signal: PTB23/SPI0_PCS5/FXIO0_D7, label: 'CN9[69]'}
- {pin_num: '70', pin_signal: ADC0_SE14/PTC0/SPI0_PCS4/PDB0_EXTRG/USB_SOF_OUT/FXIO0_D3/SPI0_PCS0, label: 'CN9[70]/CN2[32]/SD_DET', identifier: SD_DET}
- {pin_num: '71', pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/TPM0_CH0/I2S0_TXD0/LPUART0_RTS_b, label: 'CN9[71]/CN2[26]/LCD_CD', identifier: LCD_CD}
- {pin_num: '72', pin_signal: ADC0_SE4b/PTC2/SPI0_PCS2/UART1_CTS_b/TPM0_CH1/I2S0_TX_FS/LPUART0_CTS_b, label: 'CN9[72]/CN2[25]/SPI0_PCS2/LCD_CS', identifier: LCD_CS}
- {pin_num: '73', pin_signal: PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/TPM0_CH2/CLKOUT/I2S0_TX_BCLK/LPUART0_RX, label: 'CN9[73]/CN1[4]/SD_CS/SPI0_PCS1/SD_DAT3', identifier: SPI0_PCS1}
- {pin_num: '76', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/TPM0_CH3/LPI2C0_HREQ/LPUART0_TX, label: 'CN9[76]/CN2[29]/SPI0_PCS0/FLASH_CS', identifier: SPI0_PCS0}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/I2S0_RXD0/CMP0_OUT/TPM0_CH2, label: 'CN9[77]/CN2[27]/CN1[3]/SPI0_SCK/SD_CLK', identifier: SPI0_SCK}
- {pin_num: '78', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/I2S0_MCLK/LPI2C0_SCL, label: 'CN9[78]'}
- {pin_num: '79', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB_SOF_OUT/I2S0_RX_FS/LPI2C0_SDA, label: 'CN9[79]'}
- {pin_num: '80', pin_signal: CMP0_IN2/PTC8/LPI2C0_SCLS/I2S0_MCLK/FXIO0_D0/I2S1_RXD0, label: 'CN9[80]', identifier: LPI2C0_SCLS}
- {pin_num: '81', pin_signal: CMP0_IN3/PTC9/LPI2C0_SDAS/I2S0_RX_BCLK/FXIO0_D1/I2S1_RX_BCLK, label: 'CN9[81]', identifier: LPI2C0_SDAS}
- {pin_num: '82', pin_signal: PTC10/LPI2C1_SCL/I2S0_RX_FS/FXIO0_D2/I2S1_RX_FS, label: 'CN9[82]/CN8[2]/ISO7816_RST', identifier: I2S1_RX_FS}
- {pin_num: '83', pin_signal: PTC11/LLWU_P11/LPI2C1_SDA/FXIO0_D3/I2S1_MCLK, label: 'CN9[83]ISO7816_PWR', identifier: I2S1_MCLK}
- {pin_num: '84', pin_signal: PTC12/LPI2C1_SCLS/TPM_CLKIN0/FXIO0_D0, label: 'CN9[84]/CN1[7]/KEY0', identifier: KEY0}
- {pin_num: '85', pin_signal: PTC13/LPI2C1_SDAS/TPM_CLKIN1/FXIO0_D1, label: 'CN9[85]/CN1[8]/KEY1', identifier: KEY1}
- {pin_num: '86', pin_signal: PTC14/LPUART0_RTS_b/FXIO0_D2, label: 'CN9[86]/CN1[9]/KEY2', identifier: KEY2}
- {pin_num: '87', pin_signal: PTC15/LPUART0_CTS_b/FXIO0_D3, label: 'CN9[87]/CN1[10]/KEY3', identifier: KEY3}
- {pin_num: '90', pin_signal: PTC16/CAN1_RX/LPUART0_RX/FXIO0_D4, label: 'CN9[90]/CN1[11]/LPUART0_RX', identifier: CAN1_RX}
- {pin_num: '91', pin_signal: PTC17/CAN1_TX/LPUART0_TX/FXIO0_D5, label: 'CN9[91]/CN1[12]/LPUART0_TX', identifier: CAN1_TX}
- {pin_num: '92', pin_signal: PTC18/LPUART0_RTS_b, label: 'CN9[92]'}
- {pin_num: '93', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/LPUART0_RTS_b/FXIO0_D6, label: 'CN9[93]/M1[4]/K2/WAKEUP', identifier: LPUART0_RTS}
- {pin_num: '94', pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART2_CTS_b/LPUART0_CTS_b/FXIO0_D7, label: 'CN9[94]/CN13[23]/CLCD_BLC', identifier: CLCD_BLC}
- {pin_num: '95', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/LPUART0_RX/LPI2C0_SCL, label: 'CN9[95]/CN2[28]/CN2[18]/SPI0_SOUT/SD_CMD/IR_IN', identifier: IR_IN}
- {pin_num: '96', pin_signal: PTD3/SPI0_SIN/UART2_TX/LPUART0_TX/LPI2C0_SDA, label: 'CN9[96]/CN2[30]/CN1[2]/CN2[5]/SPI0_SIN/SD_DAT0/IR_OUT', identifier: IR_OUT}
- {pin_num: '97', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/TPM0_CH4/EWM_IN/SPI1_PCS0, label: 'CN9[97]/CN13[1]/SPI1_PCS0/CLCD_CS', identifier: CLCD_CS}
- {pin_num: '98', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/TPM0_CH5/EWM_OUT_b/SPI1_SCK, label: 'CN9[98]/CN13[3]/SPI1_SCK/CLCD_SCLK', identifier: CLCD_SCLK}
- {pin_num: '99', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/SPI1_SOUT, label: 'CN9[99]/CN13[30]/SPI1_SOUT/CLCD_MOSI', identifier: CLCD_MOSI}
- {pin_num: '100', pin_signal: PTD7/UART0_TX/SPI1_SIN, label: 'CN9[100]/CN13[29]/SPI1_SIN/CLCD_MISO', identifier: CLCD_MISO}
- {pin_num: '11', pin_signal: USB0_DM, label: 'CN9[11]/CN2[16]/CN3[2]/USB_DM', identifier: USB_DM}
- {pin_num: '10', pin_signal: USB0_DP, label: 'CN9[10]/CN2[15]/CN3[3]/USB_DP', identifier: USB_DP}
- {pin_num: '12', pin_signal: USBVDD, label: MCU_VDD}
- {pin_num: '1', pin_signal: ADC0_SE4a/PTE0/CLKOUT32K/SPI1_PCS1/UART1_TX/LPI2C1_SDA/RTC_CLKOUT, label: 'CN9[1]/M1[5]/CN2[24]/UART1_TX/DBG_TXD', identifier: DEBUG_UART_TX}
- {pin_num: '2', pin_signal: ADC0_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/LPI2C1_SCL/SPI1_SIN, label: 'CN9[2]/CN2[31]/M1[6]/UART1_RX/DBG_RXD', identifier: DEBUG_UART_RX}
- {pin_num: '3', pin_signal: ADC0_SE6a/PTE2/LLWU_P1/SPI1_SCK/UART1_CTS_b, label: 'CN9[3]/CN4[5]/I2C_INT', identifier: I2C_INT}
- {pin_num: '4', pin_signal: ADC0_SE7a/PTE3/SPI1_SIN/UART1_RTS_b/SPI1_SOUT, label: 'CN9[4]/CN2[23]/USB_PWR'}
- {pin_num: '5', pin_signal: PTE4/LLWU_P2/SPI1_PCS0/LPUART0_TX/LPI2C1_SDA, label: 'CN9[5]/CN1[13]/CN5[4]/LPUART0_TX', identifier: LPUART0_TX}
- {pin_num: '6', pin_signal: PTE5/SPI1_PCS2/LPUART0_RX/LPI2C1_SCL, label: 'CN9[6]/CN1[14]/CN5[3]/LPUART0_RX', identifier: LPUART0_RX}
- {pin_num: '7', pin_signal: PTE6/SPI1_PCS3/LPUART0_CTS_b/I2S0_MCLK/USB_SOF_OUT, label: 'CN9[7]/CN3[4]/USB_ID', identifier: USB_ID}
- {pin_num: '14', pin_signal: ADC0_DP1, label: 'CN9[14]/ADC0_DP1', identifier: ADC0_DP1}
- {pin_num: '15', pin_signal: ADC0_DM1, label: 'CN9[15]/ADC0_DM1', identifier: ADC0_DM1}
- {pin_num: '17', pin_signal: ADC0_DM2, label: 'CN9[17]/ADC0_DM2', identifier: ADC0_DM2}
- {pin_num: '16', pin_signal: ADC0_DP2, label: 'CN9[16]/ADC0_DP2', identifier: ADC0_DP2}
- {pin_num: '18', pin_signal: ADC0_DP0, label: 'CN9[18]/CN2[14]/ADC0_DP0', identifier: ADC0_DP0}
- {pin_num: '19', pin_signal: ADC0_DM0, label: 'CN9[19]/CN2[13]/ADC0_DM0', identifier: ADC0_DM0}
- {pin_num: '20', pin_signal: ADC0_DP3, label: 'CN9[20]/ADC0_DP3', identifier: ADC0_DP3}
- {pin_num: '21', pin_signal: ADC0_DM3, label: 'CN9[21]/ADC0_DM3', identifier: ADC0_DM3}
- {pin_num: '26', pin_signal: CMP0_IN5, label: 'CN9[26]/CMP0_IN5', identifier: CMP0_IN5}
- {pin_num: '27', pin_signal: DAC0_OUT/ADC0_SE23, label: 'CN9[27]/CN1[20]/DAC0_OUT', identifier: DAC0_OUT}
- {pin_num: '52', pin_signal: RESET_b, label: 'CN9[52]/CN6[15]/CN1[25]/K1/nRST', identifier: RESET}
- {pin_num: '28', pin_signal: XTAL32, label: 'CN9[28]/XTAL32_RTC', identifier: XTAL32}
- {pin_num: '29', pin_signal: EXTAL32, label: 'CN9[29]/EXTAL32_RTC', identifier: EXTAL32}
- {pin_num: '30', pin_signal: VBAT, label: 'CN9[30]/VBAT'}
- {pin_num: '8', pin_signal: VDD8, label: MCU_VDD}
- {pin_num: '22', pin_signal: VDDA, label: MCU_VDD}
- {pin_num: '40', pin_signal: VDD44, label: MCU_VDD}
- {pin_num: '48', pin_signal: VDD52, label: MCU_VDD}
- {pin_num: '61', pin_signal: VDD65, label: MCU_VDD}
- {pin_num: '75', pin_signal: VDD79, label: MCU_VDD}
- {pin_num: '89', pin_signal: VDD93, label: MCU_VDD}
- {pin_num: '9', pin_signal: VSS9, label: GND}
- {pin_num: '25', pin_signal: VSSA, label: GND}
- {pin_num: '41', pin_signal: VSS45, label: GND}
- {pin_num: '49', pin_signal: VSS53, label: GND}
- {pin_num: '60', pin_signal: VSS64, label: GND}
- {pin_num: '74', pin_signal: VSS78, label: GND}
- {pin_num: '88', pin_signal: VSS92, label: GND}
- {pin_num: '31', pin_signal: ADC0_SE17/PTE24/CAN1_TX/TPM0_CH0/I2S1_TX_FS/LPI2C0_SCL/EWM_OUT_b, label: 'CN9[31]/CN1[18]/CAN_TX1', identifier: CAN1_TX}
- {pin_num: '32', pin_signal: ADC0_SE18/PTE25/CAN1_RX/TPM0_CH1/I2S1_TX_BCLK/LPI2C0_SDA/EWM_IN, label: 'CN9[32]/CN1[17]/CAN_RX1', identifier: CAN1_RX}
- {pin_num: '33', pin_signal: PTE26/CLKOUT32K/I2S1_TXD0/RTC_CLKOUT/USB_CLKIN, label: 'CN9[33]/USB_CLKIN', identifier: USB_CLKIN}
- {pin_num: '23', pin_signal: VREFH, label: MCU_VDD}
- {pin_num: '24', pin_signal: VREFL, label: GND}
- {pin_num: '13', pin_signal: NC, label: NC}
- {pin_num: '51', pin_signal: XTAL0/PTA19/TPM_CLKIN1/LPTMR0_ALT1, label: 'CN9[51]/XTAL', identifier: XTAL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

