Masmiseim36/nxpSDK/boards/mapsks22/project_template/pin_mux.c
    const port_pin_config_t LED_RED2 = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Slow slew rate is configured */
                                        kPORT_SlowSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is enabled */
                                        kPORT_OpenDrainEnable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as PTB9 */
                                        kPORT_MuxAsGpio,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinConfig(BOARD_LED_RED2_PORT, BOARD_LED_RED2_PIN, &LED_RED2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitKEYS:
- options: {prefix: BAORD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '84', peripheral: GPIOC, signal: 'GPIO, 12', pin_signal: PTC12/LPI2C1_SCLS/TPM_CLKIN0/FXIO0_D0, direction: INPUT, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '85', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: PTC13/LPI2C1_SDAS/TPM_CLKIN1/FXIO0_D1, direction: INPUT, slew_rate: fast, open_drain: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '86', peripheral: GPIOC, signal: 'GPIO, 14', pin_signal: PTC14/LPUART0_RTS_b/FXIO0_D2, direction: INPUT, slew_rate: fast, open_drain: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: '87', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: PTC15/LPUART0_CTS_b/FXIO0_D3, direction: INPUT, slew_rate: fast, open_drain: enable, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitKEYS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitKEYS(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t KEY0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 84)  */
    GPIO_PinInit(BAORD_KEY0_GPIO, BAORD_KEY0_PIN, &KEY0_config);

    gpio_pin_config_t KEY1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC13 (pin 85)  */
    GPIO_PinInit(BAORD_KEY1_GPIO, BAORD_KEY1_PIN, &KEY1_config);

    gpio_pin_config_t KEY2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 86)  */
    GPIO_PinInit(BAORD_KEY2_GPIO, BAORD_KEY2_PIN, &KEY2_config);

    gpio_pin_config_t KEY3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 87)  */
    GPIO_PinInit(BAORD_KEY3_GPIO, BAORD_KEY3_PIN, &KEY3_config);

    const port_pin_config_t KEY0 = {/* Internal pull-up resistor is enabled */
                                    kPORT_PullUp,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Passive filter is disabled */
                                    kPORT_PassiveFilterDisable,
                                    /* Open drain is enabled */
                                    kPORT_OpenDrainEnable,
                                    /* Low drive strength is configured */
                                    kPORT_LowDriveStrength,
                                    /* Pin is configured as PTC12 */
                                    kPORT_MuxAsGpio,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORTC12 (pin 84) is configured as PTC12 */
    PORT_SetPinConfig(BAORD_KEY0_PORT, BAORD_KEY0_PIN, &KEY0);

    const port_pin_config_t KEY1 = {/* Internal pull-up resistor is enabled */
                                    kPORT_PullUp,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Passive filter is disabled */
                                    kPORT_PassiveFilterDisable,
                                    /* Open drain is enabled */
                                    kPORT_OpenDrainEnable,
                                    /* Low drive strength is configured */
                                    kPORT_LowDriveStrength,
                                    /* Pin is configured as PTC13 */
                                    kPORT_MuxAsGpio,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORTC13 (pin 85) is configured as PTC13 */
    PORT_SetPinConfig(BAORD_KEY1_PORT, BAORD_KEY1_PIN, &KEY1);

    const port_pin_config_t KEY2 = {/* Internal pull-up resistor is enabled */
                                    kPORT_PullUp,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Passive filter is disabled */
                                    kPORT_PassiveFilterDisable,
                                    /* Open drain is enabled */
                                    kPORT_OpenDrainEnable,
                                    /* Low drive strength is configured */
                                    kPORT_LowDriveStrength,
                                    /* Pin is configured as PTC14 */
                                    kPORT_MuxAsGpio,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORTC14 (pin 86) is configured as PTC14 */
    PORT_SetPinConfig(BAORD_KEY2_PORT, BAORD_KEY2_PIN, &KEY2);

    const port_pin_config_t KEY3 = {/* Internal pull-up resistor is enabled */
                                    kPORT_PullUp,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Passive filter is disabled */
                                    kPORT_PassiveFilterDisable,
                                    /* Open drain is enabled */
                                    kPORT_OpenDrainEnable,
                                    /* Low drive strength is configured */
                                    kPORT_LowDriveStrength,
                                    /* Pin is configured as PTC15 */
                                    kPORT_MuxAsGpio,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORTC15 (pin 87) is configured as PTC15 */
    PORT_SetPinConfig(BAORD_KEY3_PORT, BAORD_KEY3_PIN, &KEY3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSMART_CARD:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '82', peripheral: GPIOC, signal: 'GPIO, 10', pin_signal: PTC10/LPI2C1_SCL/I2S0_RX_FS/FXIO0_D2/I2S1_RX_FS, direction: INPUT, slew_rate: fast, open_drain: enable,
    pull_select: down, pull_enable: disable}
  - {pin_num: '35', peripheral: TPM1, signal: 'CH, 1', pin_signal: PTA1/UART0_RX/CMP0_OUT/LPI2C1_HREQ/TPM1_CH1/JTAG_TDI, direction: OUTPUT, slew_rate: fast, open_drain: disable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '36', peripheral: UART0, signal: TX, pin_signal: PTA2/UART0_TX/TPM1_CH0/JTAG_TDO/TRACE_SWO, direction: INPUT/OUTPUT, slew_rate: fast, open_drain: disable,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

